<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Carlos Rueda">
   <meta name="GENERATOR" content="Mozilla/4.78 [en] (Windows NT 5.0; U) [Netscape]">
   <title>Hola</title>
</head>
<body text="#000000" bgcolor="#FFE6CC" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<blockquote><b><font face="Arial,Helvetica"><font size=+1>Conceptos claves</font></font></b>
<br><font face="Arial,Helvetica">Los siguientes son t&eacute;rminos y conceptos
centrales para interactuar con el sistema Loro.</font></blockquote>

<blockquote>
<table BORDER CELLSPACING=0 CELLPADDING=10 NOSAVE >
<tr VALIGN=TOP>
<td VALIGN=TOP><b><font face="Arial,Helvetica">Proyecto</font></b></td>

<td><font face="Arial,Helvetica">Es el elemento integral de organizaci&oacute;n
de tu trabajo. Un proyecto es el conjunto de componentes de desarrollo
asociados a una tarea o misi&oacute;n concreta. Algunos proyectos de demostraci&oacute;n
vienen incluidos con el sistema y otros se pueden incorporar mediante algunos
mecanismos para ello. Loro destina una ventana de trabajo para cada proyecto.</font></td>
</tr>

<tr VALIGN=TOP>
<td><b><font face="Arial,Helvetica">Espacio de trabajo</font></b></td>

<td><font face="Arial,Helvetica">Es el conjunto de proyectos que pueden
accederse en un momento dado. "Acceder" un proyecto significa abrirlo para
trabajar en &eacute;l, o simplemente referir elementos contenidos en &eacute;l
(por ejemplo, invocar un cierto algoritmo). Para abrir un proyecto del
espacio de trabajo, utiliza el comando <b>Ctrl-O</b>. Para instalar un
proyecto en el espacio de trabajo, utiliza el comando <b>Ctrl-I</b>.</font></td>
</tr>

<tr VALIGN=TOP>
<td><b><font face="Arial,Helvetica">Edici&oacute;n</font></b></td>

<td><font face="Arial,Helvetica">Se refiere a la escritura de c&oacute;digo
fuente en el lenguaje.&nbsp; Loro destina un "editor" (ventana) para cada
componente del proyecto. Toda edici&oacute;n o despliegue de c&oacute;digo
fuente siempre se hace con lo que se suele llamar "coloreamiento sint&aacute;ctico",
es decir, con utilizaci&oacute;n de colores y resaltados para distinguir
los diferentes elementos en el programa.</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td NOSAVE><b><font face="Arial,Helvetica">Compilaci&oacute;n</font></b></td>

<td><font face="Arial,Helvetica">Significa hacer que el sistema revise
lo que est&aacute; escrito para verificar que se respeten las reglas del
lenguaje en los aspectos de <b><i>forma</i></b> y <b><i>contenido</i></b>.
La forma se refiere a la estructura que un programa debe tener (por ejemplo,
que despu&eacute;s de una palabra clave <b>si</b> venga una expresi&oacute;n
y luego una palabra clave
<b>entonces</b>); y el contenido se refiere a
que el programa respete ciertas reglas de consistencia a un mayor nivel
(por ejemplo, que a una variable de tipo <b>cadena</b> no se le asigne
una expresion de tipo <b>entero</b>, o que un arreglo no se subindice con
un valor
<b>real </b>como 3.14). Ante cualquier problema con el c&oacute;digo,
el sistema despliega un mensaje de aviso y selecciona el &aacute;rea de
texto comprometida con el error en la ventana de edici&oacute;n correspondiente.</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td><b><font face="Arial,Helvetica">Ejecuci&oacute;n</font></b></td>

<td NOSAVE><font face="Arial,Helvetica">Se refiere a llevar a cabo las
acciones o instrucciones de un algoritmo.&nbsp; El entorno ofrece facilidades
para ejecutar cualquier algoritmo, hacer la captura interactiva de sus
posibles entradas, tambi&eacute;n la ejecuci&oacute;n de fragmentos de
c&oacute;digo a trav&eacute;s del int&eacute;rprete interactivo, y la modalidad
de <i>paso-a-paso </i>como ayuda para la depuraci&oacute;n del c&oacute;digo.</font></td>
</tr>

<tr VALIGN=TOP>
<td VALIGN=TOP><b><font face="Arial,Helvetica">Prueba de unidades</font></b></td>

<td><font face="Arial,Helvetica">Loro incluye facilidades para poner en
pr&aacute;ctica la aplicaci&oacute;n de pruebas a nivel de algoritmos individuales
como a nivel de proyecto completo.&nbsp;</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td><b><font face="Arial,Helvetica">Documentaci&oacute;n</font></b></td>

<td NOSAVE><font face="Arial,Helvetica"><i>&iquest;Qu&eacute; se tiene?,
&iquest;para qu&eacute; sirve?, &iquest;c&oacute;mo se usa?&nbsp; y &iquest;bajo
qu&eacute; condiciones?</i>, son algunas de las consideraciones que se
presentan permanentemente en la pr&aacute;ctica de la programaci&oacute;n.
Puesto que la mayor parte del software se contruye sobre software ya existente,
se vuelve imprescindible contar con toda la documentaci&oacute;n posible
que resuelva estas preguntas. Loro genera autom&aacute;ticamente esta documentaci&oacute;n
en un formato HTML (es decir, en estilo p&aacute;gina de Internet) con
base en los elementos del lenguaje destinados para tal fin.</font></td>
</tr>
</table>
</blockquote>

</body>
</html>
