<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Carlos Rueda">
   <meta name="GENERATOR" content="Mozilla/4.78 [en] (Windows NT 5.0; U) [Netscape]">
   <title>Hola</title>
</head>
<body text="#000000" bgcolor="#FFE6CC" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<blockquote>
<h2>
<font face="Arial,Helvetica">Hola!</font></h2>
<font face="Arial,Helvetica">Y gracias por incluir a LORO como herramienta
de apoyo en el aprendizaje de la programaci&oacute;n!</font>
<p><font face="Arial,Helvetica">Como se trata de un proyecto en desarrollo,
te invitamos a compartir tus sugerencias y tambi&eacute;n tus cr&iacute;ticas;
todas ellas se constituyen en un aporte valioso para el mejoramiento del
sistema.</font>
<p><b><font face="Arial,Helvetica">Nuestro prop&oacute;sito</font></b>
<br><font face="Arial,Helvetica">Sabemos que quieres aprender a programar,
y quiz&aacute;s tienes en mente alguno de esos famosos lenguajes como Java,
C++, Lisp, Pascal, C#, etc.&nbsp; Pues bien, la propuesta Loro NO es para
hacerte cambiar de planes. Por el contrario, queremos que llegues a ellos
por un camino ojal&aacute; menos complicado pero, en todo caso, bajo un
marco de trabajo en que se enfaticen los conceptos claves m&aacute;s relevantes
de la programaci&oacute;n. Partimos del supuesto de que lo importante es
"<b>aprender a programar bien</b>" m&aacute;s que aprender un cierto lenguaje
de programaci&oacute;n. Como alg&uacute;n lenguaje hay que utilizar, hemos
decidido definir uno propio pensando concretamente en fines did&aacute;cticos,
sin preocuparnos por otras consideraciones que son altamente prioritarias
en los lenguajes industriales, pero que podemos ignorar a un nivel introductorio
(adem&aacute;s, nos salvamos de paso de muchas complicaciones!). Adem&aacute;s,
se trata de un proyecto <b>abierto</b> en donde todas las personas interesadas
pueden hacer su aporte. Visita la p&aacute;gina de Loro en </font><tt>http://loro.sf.net</tt><font face="Arial,Helvetica">
para saber m&aacute;s sobre el proyecto.</font>
<p><font face="Arial,Helvetica">El proyecto Loro est&aacute; concentrado
ahora en lo que se ha denominado el nivel I, en donde lo importante es
el concepto de <b>proceso</b>, con &eacute;nfasis tanto en lo <i>algor&iacute;tmico</i>,
como en la debida <i>especificaci&oacute;n</i> de los problemas. Esta divisi&oacute;n
por niveles permite abordar de manera incremental algunas de las diferentes
facetas que presenta la pr&aacute;ctica de la programaci&oacute;n. En este
primer nivel lo importante es la definici&oacute;n precisa de la relaci&oacute;n
<i>entrada/salida</i> para los procesos, la familiarizaci&oacute;n con
el manejo de <i>pre</i>- y <i>pos-condiciones</i>, as&iacute; como una
primera aproximaci&oacute;n a los <i>objetos</i>.</font></blockquote>

<blockquote><b><font face="Arial,Helvetica"><font size=+1>Conceptos claves</font></font></b>
<br><font face="Arial,Helvetica">Los siguientes son t&eacute;rminos y conceptos
centrales para interactuar con el sistema Loro:</font></blockquote>

<blockquote>&nbsp;
<table CELLSPACING=10 NOSAVE >
<tr>
<td VALIGN=TOP><b><font face="Arial,Helvetica">Proyecto</font></b></td>

<td><font face="Arial,Helvetica">Es el elemento integral de organizaci&oacute;n
de tu trabajo. Un proyecto es el conjunto de componentes de desarrollo
asociados a una tarea o misi&oacute;n concreta. Algunos proyectos de demostraci&oacute;n
vienen incluidos con el sistema y otros se pueden incorporar mediante algunos
mecanismos para ello. Loro destina una ventana de trabajo para cada proyecto.</font></td>
</tr>

<tr>
<td><b><font face="Arial,Helvetica">Espacio de trabajo</font></b></td>

<td><font face="Arial,Helvetica">Es el conjunto de proyectos que pueden
accederse en un momento dado. "Acceder" un proyecto puede ser abrirlo para
trabajar en &eacute;l, o simplemente referir elementos contenidos en &eacute;l
(por ejemplo, invocar un cierto algoritmo).</font></td>
</tr>

<tr>
<td><b><font face="Arial,Helvetica">Edici&oacute;n</font></b></td>

<td><font face="Arial,Helvetica">Se refiere a la escritura de c&oacute;digo
fuente en el lenguaje.&nbsp; Loro destina un "editor" (ventana) para cada
componente del proyecto.</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td NOSAVE><b><font face="Arial,Helvetica">Compilaci&oacute;n</font></b></td>

<td><font face="Arial,Helvetica">Significa hacer que el sistema revise
lo que est&aacute; escrito para verificar que se respeten las reglas del
lenguaje en los aspectos de <b><i>forma</i></b> y <b><i>contenido</i></b>.
La forma se refiere a la estructura que un programa debe tener (por ejemplo,
que despu&eacute;s de un <b>si</b> venga una expresi&oacute;n y luego un
<b>entonces</b>);
y el contenido se refiere a que el programa respete ciertas reglas de consistencia
a un mayor nivel (por ejemplo, que a una variable de tipo <b>cadena</b>
no se le asigne una expresion de tipo <b>entero</b>, o que un arreglo no
se subindice con un valor
<b>real </b>como 3.14). Ante cualquier problema
con el c&oacute;digo, el sistema despliega un mensaje de aviso y selecciona
el &aacute;rea de texto comprometida con el error en la ventana de edici&oacute;n
correspondiente.</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td><b><font face="Arial,Helvetica">Ejecuci&oacute;n</font></b></td>

<td NOSAVE><font face="Arial,Helvetica">Se refiere a llevar a cabo las
acciones o instrucciones de un <b>algoritmo</b> para resolver el problema
definido en la correspondiente <b>especificaci&oacute;n</b>.&nbsp; El entorno
ofrece facilidades para ejecutar cualquier algoritmo, hacer la captura
interactiva de sus posibles entradas, e incluso la ejecuci&oacute;n de
fragmentos de c&oacute;digo a trav&eacute;s del int&eacute;rprete interactivo.</font></td>
</tr>

<tr VALIGN=TOP NOSAVE>
<td><b><font face="Arial,Helvetica">Documentaci&oacute;n</font></b></td>

<td NOSAVE><font face="Arial,Helvetica"><i>&iquest;Qu&eacute; se tiene?,
&iquest;para qu&eacute; sirve?, &iquest;c&oacute;mo se usa?&nbsp; y &iquest;bajo
qu&eacute; condiciones?</i>, son algunas de las consideraciones que se
presentan permanentemente en la pr&aacute;ctica de la programaci&oacute;n.
Puesto que la mayor parte del software se contruye sobre software ya existente,
se vuelve imprescindible contar con toda la documentaci&oacute;n posible
que resuelva estas preguntas. Loro genera autom&aacute;ticamente esta documentaci&oacute;n
con base en los elementos del lenguaje destinados para tal fin.</font></td>
</tr>
</table>
</blockquote>

</body>
</html>
